namespace ShareInvest;

public enum Balance
{
    계좌번호 = 9201,
    종목코드_업종코드 = 9001,
    신용구분 = 917,
    대출일 = 916,
    종목명 = 302,
    현재가 = 10,
    보유수량 = 930,
    매입단가 = 931,
    총매입가 = 932,
    주문가능수량 = 933,
    당일순매수량 = 945,
    매도_매수구분 = 946,
    당일총매도손익 = 950,
    예수금 = 951,
    매도호가 = 27,
    매수호가 = 28,
    기준가 = 307,
    손익율 = 8019,
    신용금액 = 957,
    신용이자 = 958,
    만기일 = 918,
    당일실현손익_유가 = 990,
    당일실현손익률_유가 = 991,
    당일실현손익_신용 = 992,
    당일실현손익률_신용 = 993,
    담보대출수량 = 959,
    ExtraItem = 924
}

public enum OrderStatus
{
    매도 = 1,
    매수 = 2
}